# St7SetBrickLighting

Sets the state of the Lighting options for brick rendering.

long St7SetBrickLighting(long uID, bool FillLighting, bool LineLighting)
Input Parameters
uID
Strand7 model file ID.
FillLighting
The lighting option for the brick fill; either True or False.
LineLighting
The lighting option for the brick outlines; either True or False.